time=input("Enter time in the format hh:mm\n")

if time.count(":") == 1:
    hh=time.split(":")[0]
    mm=time.split(":")[1]  
    if hh.isdigit() and mm.isdigit() and 0 <= int(hh) <= 23 and 0 <= int(mm) <= 59:
        hh=int(hh)
        mm=int(mm)
    else:
        print("You entered the wrong data format")
        exit()
else:
    print("You entered the wrong data format")
    exit()

if hh>12:
    hh=hh-12
else:
    hh=hh

hh_key1 = {0:"ноль", 1:"час", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 12:"двенадцать"}
hh_key2 = {0:"первого", 1:"второго", 2:"третьего", 3:"четвертого", 4:"пятого", 5:"шестого", 6:"седьмого", 7:"восьмого", 8:"девятого", 9:"десятого", 10:"одиннадцатого", 11:"двенадцатого", 12:"первого"}
mm_key1 = {1:"одна", 2:"две", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 12:"двенадцать", 13:"тринадцать", 14:"четырнадцать", 15:"пятнадцать", 16:"шестнадцать", 17:"семнадцать", 18:"восемнадцать", 19:"девятнадцать", 20:"двадцать", 21:"двадцать одна", 22:"двадцать две", 23:"двадцать три", 24:"двадцать черыте", 25:"двадцать пять", 26:"двадцать шесть", 27:"двадцать семь", 28:"двадцать восемь", 29:"двадцать девять"}
mm_key2 = {3:"тридцать",4:"сорок"}
mm_key3 = {15:"пятнадцати",14:"четырнадцати", 13:"тринадцати", 12:"двенадцати", 11:"одиннадцати", 10:"десяти", 9:"девяти", 8:"восьми", 7:"семи", 6:"шести", 5:"пяти", 4:"четырех", 3:"трех", 2:"двух", 1:"одной"}

if mm==0 and hh>=5 or mm==0 and hh==0:
    print(f"{time} - {hh_key1[hh]} часов ровно")
elif mm==0 and 1<hh<=4:
    print(f"{time} - {hh_key1[hh]} часа ровно") 
elif mm==0:
    print(f"{time} - {hh_key1[hh]} ровно")
elif  mm>=1 and mm<=29:
    print(f"{time} - {mm_key1[mm]} минут {hh_key2[hh]}")
elif mm==30 and hh>=0:
    print(f"{time} - половина {hh_key2[hh]}")
elif 30<mm<45:
    if mm==40:
        print(f"{time} - {mm_key2[mm//10]} минут {hh_key2[hh]}")
    else:        
        print(f"{time} - {mm_key2[mm//10]} {mm_key1[mm-(mm//10*10)]} минут {hh_key2[hh]}") 
elif mm>=45:
    print(f"{time} - без {mm_key3[60-mm]} минут {hh_key1[hh+1]}")