time = input('Enter your time value in the following format hh:mm\n')

hh = time.split(':')[0]
mm = time.split(':')[1]

try:
    int(hh)
    int(mm)
except ValueError:
    print('Wrong format')
    exit(1)

hh = int(hh)
mm = int(mm)

dict_hours = {1:['час','первого'],2:['два','второго'],3:['три','третьего'],4:['четыре','четвертого'],5:['пять','пятого'],6:['шесть','шестого'],
              7:['семь','седьмого'],8:['восемь','восьмого'],9:['девять','девятого'],10:['десять','десятого'],11:['одинадцать','одинадцатого'],
              12:['двенадцать','двенадцатого'],13:['час','первого'],14:['два','второго'],15:['три','третьего'],16:['четыре','четвертого'],
              17:['пять','пятого'],18:['шесть','шестого'],19:['семь','седьмого'],20:['восемь','восьмого'],21:['девять','девятого'],
              22:['десять','десятого'],23:['одинадцать','одинадцатого'],00:['двенадцать','двенадцатого']}

in_btw = {00:'ровно',15:'пятнадцать',30:['половина'], 40:['сорок'],45:'без пятнадцати'}

chasy = ['час','часов','часа']
minuty = ['минут','минута','минуты']
bez = 'без'

dict_min = {1:['одна', 'одной'],2:['две', 'двух'],3:['три','трех'],4:['четыре','четырех'],5:['пять','пяти'],6:['шесть','шести'],7:['семь','семи'],
            8:['восемь','восьми'],9:['девять','девяти'],10:['десять','десяти'],11:['одинадцать','одинадцати'],12:['двенадцать','двенадцати'],
            13:['тринадцать','тринадцати,'],14:['четырнадцать','четырнадцати'], 15:['пятнадцать','пятнадцати'],16:['шестандцать'],17:['семнадцать'],
            18:['восемнадцать'],19:['девятнадцать'],20:['двадцать'],21:['двадцать одна'],22:['двадцать две'],23:['двадцать три'],24:['двадцать четыре'],
            25:['двадцать пять'],26:['двадцать шесть'],27:['двадцать семь'],28:['двадцать восемь'],29:['двадцать девять'], 31:['тридцать одна'],
            32:['тридцать две'],33:['тридцать три'],34:['тридцать четыре'],35:['тридцать пять'],36:['тридцать шесть'],37:['тридцать семь'],
            38:['тридцать восемь'],39:['тридцать девять'], 41:['сорок одна'],42:['сорок две'],43:['сорок три'],44:['сорок четыре']}

if mm ==0 and hh>=5 or mm==0 and hh==0:
    print(f'{time} - {dict_hours[hh][0]} {chasy[1]} {in_btw[00]}')
elif mm==0 and 1<hh<=4:
    print(f'{time} - {dict_hours[hh][0]} {chasy[2]} {in_btw[00]}')
elif mm==0:
    print(f'{time} - {dict_hours[hh][0]} {in_btw[00]}')
elif 1<=mm<=29:
    print(f'{time} - {dict_min[mm][0]} {minuty[0]} {dict_hours[hh+1][1]}')
elif mm==30:
    print(f'{time} - {in_btw[30][0]} {dict_hours[hh+1][1]}')
elif mm==31 or mm==41:
    print(f'{time} - {dict_min[mm][0]} {minuty[1]} {dict_hours[hh+1][1]}')
elif 31<mm<45:
    print(f'{time} - {dict_min[mm][0]} {minuty[2]} {dict_hours[hh+1][1]}')
elif mm==45:
    print(f'{time} - {in_btw[45]} {dict_hours[hh+1][0]}')
elif mm==59:
    print(f'{time} - {bez} {dict_min[60-mm][1]} {minuty[2]} {dict_hours[hh+1][0]}')
else:
    print(f'{time} - {bez} {dict_min[60-mm][1]} {minuty[0]} {dict_hours[hh+1][0]}')