dict = {
    "hours": {
        "00": "ноль", "01": "один", "02": "два", "03": "три", "04": "четыре", "05": "пять", "06": "шесть", "07": "семь", "08": "восемь",
        "09": "девять", "10": "десять", "11": "одиннадцать", "12": "двенадцать", "13": "один", "14": "два", "15": "три", "16": "четыре",
        "17": "пять", "18": "шесть", "19": "семь", "20": "восемь", "21": "девять", "22": "десять", "23": "одиннадцать", "24": "двенадцать"
        },

    "minutes": {
        "01": "одна", "02": "две", "03": "три", "04": "четыре", "05": "пять", "06": "шесть", "07": "семь", "08": "восемь",
        "09": "девять", "10": "десять", "11": "одиннадцать", "12": "двенадцать", "13": "тринадцать", "14": "четырнадцать",
        "15": "пятнадцать", "16": "шестнадцать", "17": "семнадцать", "18": "восемнадцать", "19": "девятнадцать", "20": "двадцать", "30": "тридцать",
        "35": "тридцать пять", "45": "сорок пять"}
}

wrong = "You enter a wrong data"

try:
    time = input("Enter data in the format hh:mm:\n")
    hh = time[0:2]
    mm = time[3:5]
    if not (0 <= int(hh) <= 24 and 0 <= int(mm) <=59 and time[2:3] == ":") or (int(hh) == 24 and int(mm) > 0):
        print(wrong)
        exit()
except ValueError:
    print(wrong)

if int(mm) == 0:
    print(dict["hours"][f"{hh}"], "ровно")
elif int(mm) < 30:
    print(dict["minutes"][f"{mm}"], "минут", dict["hours"][f"{hh}"]) #нужно указать следующий час и изменить падеж
elif int(mm) == 30:
    print("половина", dict["hours"][f"{hh}"]) #нужно указать следующий час и изменить падеж
elif 30 < int(mm) < 45:
    print(dict["minutes"][f"{mm}"], "минут", dict["hours"][f"{hh}"]) #нужно указать следующий час и изменить падеж
elif int(mm) >= 45:
    print("без", dict["minutes"][f"{60-int(mm)}"], "минут", dict["hours"][f"{hh}"]) #нужно указать следующий час и изменить падежи в минутах и часах